intro_project/app/controllers/artworks_controller.rb

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "Untitled3"], ["image_url", "untitled3.jpg"], ["artist_id", 6], ["updated_at", "2019-04-29 20:47:37.028420"], ["id", 5]]